Table of Contents
 Class ParameterInt
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Integer parameter of cross-section
public class ParameterInt : Parameter
Inheritance
object
OpenObject
Parameter
ParameterInt
Inherited Members
 Parameter.Name
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Value
Value
public int Value { get; set; }
Property Value
int
 Edit this page